app/views/meetings/show.html.erb

SELECT "presentations".* FROM "presentations" WHERE ("presentations".meeting_id = 4)
---

  <% if @meeting.presentations.size == 0 %>