app/controllers/homepage_controller.rb

  def index
    @meeting = Meeting.upcoming_meetings.first
---
SELECT "meetings".* FROM "meetings" WHERE (meets_on > CURRENT_TIMESTAMP) ORDER BY meets_on