app/controllers/meetings_controller.rb

  def create
  	@meeting	=	Meeting.new(params[:meeting])
  	if @meeting.save
---
INSERT INTO "meetings" ("meets_on", "created_at", "location", "description", "updated_at") VALUES ('2011-11-28', '2011-11-28 11:02:15.663696', 'Southampton', 'Meeting with Professor Shadbolt', '2011-11-28 11:02:15.663696')

  def update

  	if @meeting.update_attributes(params[:meeting])
---
UPDATE "meetings" SET "updated_at" = '2011-11-28 11:31:32.260360', "description" = 'Meeting with Tope Omitola plc and family' WHERE ("meetings"."id" = 2)

  def destroy

    @meeting.destroy
---
DELETE FROM "meetings" WHERE ("meetings"."id" = 5)

  def find_meeting
    @meeting	=	Meeting.find(params[:id])
---
SELECT "meetings".* FROM "meetings" WHERE (meets_on <= CURRENT_TIMESTAMP()) ORDER BY meets_on