app/controllers/presentations_controller.rb

UPDATE "presentations" SET "description" = 'let us create some tasks', "updated_at" = '2011-11-29 12:01:12.981163' WHERE ("presentations"."id" = 1)
---
  def update
    if @presentation.update_attributes(params[:presentation])

SELECT "meetings".* FROM "meetings" WHERE ("meetings"."id" = 2) LIMIT 1
---
  def find_meeting
    @meeting = Meeting.find(params[:meeting_id])

SELECT "presentations".* FROM "presentations" WHERE ("presentations".meeting_id = 2) AND ("presentations"."id" = 1) LIMIT 1
---
  def find_presentation
    @presentation = @meeting.presentations.find(params[:id])