app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order => "name")
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def create
    @user = User.new(params[:user])

    if @user.save
---
INSERT INTO "users" ("encrypted_password", "email", "created_at", "salt", "name", "profile", "updated_at", "text", "admin") VALUES ('1e75246c42fd3812740c0d0707311a50001f51f6', 'laurence.samuels@gmail.com', '2011-11-28 16:15:08.634282', '8a178149a64c1a07400c5bebaa9aefbfdd415a17', 'Laurence Samuels', NULL, '2011-11-28 16:15:08.634282', NULL, 'f')

  def update
    @user.admin = params[:user][:admin] if admin?
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "profile" = 'My name is Tolu. Thank you', "updated_at" = '2011-11-30 12:25:54.836329', "encrypted_password" = '0fe63b9e9369de4261d442b3498ed30817c58ec4' WHERE ("users"."id" = 3)

  def find_user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1